test-results/2025-12-20/microservices/stress_r1/summary.txt
     █ login-Pemohon

       ✓ signin status is 200
       ✓ signin success flag

       █ pemohon-flow

         ✓ create permohonan 201
         ✓ submit permohonan ok

     █ login-Pimpinan

       ✓ signin status is 200
       ✓ signin success flag

       █ pimpinan-flow

         ✓ draft approve ok

     █ login-OPD

       ✓ signin status is 200
       ✓ signin success flag

       █ opd-flow

         ✓ kajian status ok

     █ login-Admin

       ✓ signin status is 200
       ✓ signin success flag

       █ admin-flow

         ✓ list permohonan 200
         ✓ approve 200
         ✓ disposisi status 201

   ✓ auth_latency...................: avg=154.78ms min=58.24ms  p(50)=133.56ms p(90)=274.81ms p(95)=325.29ms p(99)=396.1ms  max=543.62ms
     checks.........................: 100.00% ✓ 11915     ✗ 0    
     data_received..................: 11 MB   23 kB/s
     data_sent......................: 6.1 MB  13 kB/s
     group_duration.................: avg=9.48s    min=9.06ms   p(50)=10.4s    p(90)=13.83s   p(95)=14.77s   p(99)=16.44s   max=19.61s  
     http_req_blocked...............: avg=6.14µs   min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=253.66µs max=5.3ms   
     http_req_connecting............: avg=1.63µs   min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=5.3ms   
   ✓ http_req_duration..............: avg=838.28ms min=506.29µs p(50)=613.86ms p(90)=1.88s    p(95)=2.35s    p(99)=3.29s    max=5.13s   
       { expected_response:true }...: avg=838.28ms min=506.29µs p(50)=613.86ms p(90)=1.88s    p(95)=2.35s    p(99)=3.29s    max=5.13s   
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 18440
     http_req_receiving.............: avg=104.81µs min=0s       p(50)=0s       p(90)=509.9µs  p(95)=529.9µs  p(99)=1.35ms   max=15.26ms 
     http_req_sending...............: avg=24.06µs  min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=529.96µs max=32.52ms 
     http_req_tls_handshaking.......: avg=0s       min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: avg=838.15ms min=506.29µs p(50)=613.76ms p(90)=1.88s    p(95)=2.35s    p(99)=3.29s    max=5.13s   
     http_reqs......................: 18440   38.044085/s
     iteration_duration.............: avg=10.56s   min=1.43s    p(50)=11.71s   p(90)=14.63s   p(95)=15.46s   p(99)=17.15s   max=19.61s  
     iterations.....................: 3011    6.212079/s
   ✓ permohonan_latency.............: avg=1.53s    min=12.94ms  p(50)=1.43s    p(90)=2.65s    p(95)=3.04s    p(99)=3.82s    max=5.13s   
   ✓ survey_latency.................: avg=848.59ms min=182.43ms p(50)=764.71ms p(90)=1.48s    p(95)=1.72s    p(99)=2.06s    max=2.64s   
     vus............................: 1       min=1       max=75 
     vus_max........................: 75      min=75      max=75 
   ✓ workflow_latency...............: avg=708.54ms min=506.29µs p(50)=428.41ms p(90)=2.08s    p(95)=2.43s    p(99)=3.25s    max=4.89s